Tekla Open API Reference for Tekla Structures 2025
Arc.Angle Property
 Gets angle of the arc in radians.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Angle { get; }
Public ReadOnly Property Angle As Double
	Get
Property Value
Type: Double
See Also
Reference
Arc Class
Tekla.Structures.Geometry3d Namespace